#############################################

cell_colors = [
    (255, 0, 0),    # Red
    (0, 255, 0),    # Green
    (0, 0, 255),    # Blue
    (255, 255, 0),  # Yellow
    (255, 0, 255),  # Magenta
    (0, 255, 255),  # Cyan
    (128, 0, 0),    # Maroon
    (0, 128, 0),    # Green (dark)
    (0, 0, 128),    # Navy
]

#############################################

# HEX形式のカラーコード
hex_color = '#FF0000'  # RED

# HEX形式をBGR形式に変換
bgr_color = tuple(int(hex_color[i:i+2], 16) for i in (1, 3, 5))

#############################################
